const mongoose = require('mongoose')

const bidSchema = new mongoose.Schema({
    
    // 🔗 เชื่อมโยงกลับไปว่าประมูลสินค้าชิ้นไหน
    pro_id: {
        type: Number,
        ref: 'Product', // อ้างอิงถึง Model 'Product'
        required: true,
        index: true // เพิ่ม index เพื่อความเร็วในการค้นหาประวัติ
    },
    
    // 🔗 เชื่อมโยงว่าใครเป็นคนประมูล
    acc_id: {
        type: Number,
        ref: 'User', // อ้างอิงถึง Model 'User'
        required: true
    },
    
    // 💰 จำนวนเงินที่ประมูลในครั้งนั้นๆ
    bidAmount: {
        type: Number,
        required: true
    }
}, {
    timestamps: true // บันทึกเวลา (createdAt) ที่ Bid นี้เกิดขึ้นอัตโนมัติ
});

module.exports = mongoose.model('Bid', bidSchema);